mes = input()
r1 = mes[0]
r2 = mes[1]
i1 = mes[2]
r3 = mes[3]
i2 = mes[4]
i3 = mes[5]
i4 = mes[6]
rres1 = (int(i1) + int(i2) + int(i4)) % 2
rres2 = (int(i1) + int(i3) + int(i4)) % 2
rres3 = (int(i2) + int(i3) + int(i4)) % 2
s1 = (rres1 + int(r1)) % 2
s2 = (rres2 + int(r2)) % 2
s3 = (rres3 + int(r3)) % 2
if s1 == 0 and s2 == 0 and s3 == 0:
    print('Последовательность не содержит ошибок')
    print('Последовательность информационных разрядов: ' + i1 + i2 + i3 + i4)
elif s1 == 0 and s2 == 0 and s3 == 1:
    print('Неверный бит - r3')
    print('Последовательность информационных разрядов:' + i1 + i2 + i3 + i4)
elif s1 == 0 and s2 == 1 and s3 == 0:
    print('Неверный бит - r2')
    print('Последовательность информационных разрядов:' + i1 + i2 + i3 + i4)
elif s1 == 0 and s2 == 1 and s3 == 1:
    print('Неверный бит - i3')
    if i3 == '0':
        i3 = '1'
    else:
        i3 = '0'
    print('Исправленная последовательность информационных разрядов:' + i1 + i2 + i3 + i4)
elif s1 == 1 and s2 == 0 and s3 == 0:
    print('Неверный бит - r1')
    print('Последовательность информационных разрядов:' + i1 + i2 + i3 + i4)
elif s1 == 1 and s2 == 0 and s3 == 1:
    print('Неверный бит - i2')
    if i2 == '0':
        i2 = '1'
    else:
        i2 = '0'
    print('Исправленная последовательность информационных разрядов:' + i1 + i2 + i3 + i4)
elif s1 == 1 and s2 == 1 and s3 == 0:
    print('Неверный бит - i1')
    if i1 == '0':
        i1 = '1'
    else:
        i1 = '0'
    print('Исправленная последовательность информационных разрядов:' + i1 + i2 + i3 + i4)
elif s1 == 1 and s2 == 1 and s3 == 1:
    print('Неверный бит - i4')
    if i4 == '0':
        i4 = '1'
    else:
        i4 = '0'
    print('Исправленная последовательность информационных разрядов:' + i1 + i2 + i3 + i4)